In [111]:
import pandas as pd
import numpy as np

In [112]:
sozlukVerisi = {"istanbul": [30,29, np.nan], "ankara": [20,np.nan, 25], "izmir": [40,39,58]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [113]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [114]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [115]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [116]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     58

In [117]:
yeniVerisi = {"istanbul": [30,29, np.nan], "ankara": [20,np.nan, 25], "izmir": [40,39,58], "antalya": [45, np.nan, np.nan]}
yeniDataFrame = pd.DataFrame(yeniVerisi)

In [118]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     58      NaN

In [119]:
yeniDataFrame.dropna(axis=1, thresh = 2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     58

In [120]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     58      NaN

In [121]:
yeniDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     58     20.0

In [122]:
#groupby

In [123]:
maasSozlugu = {"Departman": ["yazılım", "yazılım", "pazarlama", "pazarlama", "hukuk", "hukuk"],
              "Çalışan İsmi": ["ahmet", "mehmet", "atil", "burak", "zeynep", "fatma"],
              "Maaş": [100,150,200,300,400,500] 
               }

In [124]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [125]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama         atil   200
3  pazarlama        burak   300
4      hukuk       zeynep   400
5      hukuk        fatma   500

In [126]:
groupObjesi=maasDataFrame.groupby("Departman")

In [127]:
groupObjesi.count()

           Çalışan İsmi  Maaş
Departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [128]:
groupObjesi.mean("Maaş")

            Maaş
Departman
hukuk      450.0
pazarlama  250.0
yazılım    125.0

In [129]:
groupObjesi.min()

          Çalışan İsmi  Maaş
Departman
hukuk            fatma   400
pazarlama         atil   200
yazılım          ahmet   100

In [130]:
groupObjesi.max()

          Çalışan İsmi  Maaş
Departman
hukuk           zeynep   500
pazarlama        burak   300
yazılım         mehmet   150

In [131]:
groupObjesi.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [132]:
#contact
data1 = {
        "isim" : ["ahmet", "mehmet", "atıl"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [100,200,300]
        }
dataFrame = pd.DataFrame(data1, index=[0,1,2])
dataFrame

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2    atıl  basketbol     300

In [133]:
data2 = {
        "isim" : ["osman", "levent", "fatma"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [300,100,310]
        }
dataFrame2 = pd.DataFrame(data2, index=[3,4,5])

In [134]:
dataFrame2

     isim       spor  kalori
3   osman       koşu     300
4  levent      yüzme     100
5   fatma  basketbol     310

In [135]:
data3 = {
        "isim" : ["q", "w", "f"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [300,100,310]
        }
dataFrame3 = pd.DataFrame(data3, index=[6,7,8])

In [136]:
dataFrame3

  isim       spor  kalori
6    q       koşu     300
7    w      yüzme     100
8    f  basketbol     310

In [137]:
pd.concat([dataFrame,dataFrame2,dataFrame3])

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2    atıl  basketbol     300
3   osman       koşu     300
4  levent      yüzme     100
5   fatma  basketbol     310
6       q       koşu     300
7       w      yüzme     100
8       f  basketbol     310

In [138]:
#merge

merge1 = {
        "isim" : ["osman", "levent", "fatma"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [300,100,310]
        }
mergeFrame1 = pd.DataFrame(merge1 , index=[3,4,5])

In [139]:
#merge

merge2 = {
        "isim" : ["q", "levent", "fatma"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [300,100,310]
        }
mergeFrame2 = pd.DataFrame(merge2 , index=[3,4,5])

In [142]:
#merge

merge3 = {
        "isim" : ["e", "levent", "fatma"],
        "spor" : ["koşu", "yüzme", "basketbol"],
        "kalori": [300,100,310]
        }
mergeFrame3 = pd.DataFrame(merge3 , index=[3,4,5])

In [155]:
pd.merge(mergeFrame1,mergeFrame2, on="isim")

     isim     spor_x  kalori_x     spor_y  kalori_y
0   osman       koşu       300       koşu       300
1  levent      yüzme       100      yüzme       100
2   fatma  basketbol       310  basketbol       310